<template>
  <div class="root">
    <div class="title_pic" >
      <img src="../assets/behavior_title.jpg" width="1300" >
    </div>
    <div class="title_wrd" >
      <h1><label class="blue">行</label></h1>
      <h3>有关春节的特色习俗</h3>
    </div>
    <div class="introduce">
      <el-tabs v-model="activeName" @tab-click="handleClick" style="position: center" :stretch="true">
        <el-tab-pane label="送红包" class="first">
          <div class="红包" >
            <div class="para1">
              <h1>红包文化</h1>
              农历新年的欢庆活动中，“红包”成为了亲友交往之间的关键词。近些年来，由于网络交流的高速发展以及现实生活方式的改变，我们中国人之间无意识地形成了一种独特的红包文化，并且对人际交往影响甚大。
              文化，大致上可以用一个民族的生活形式来指称它(1)，因此它表现我们日常生活中的各种独特的习俗。红包在我国不同的地域有不同的说法，粤语中称为利是或者利事，取其好意头，一切顺利，吉祥如意的意思；其他地区红包也叫红封包，红色代表中国文化里的喜庆，而喜庆场合送红包或者派利是是中国的传统习俗。红包或利是里面通常会放进带有吉祥数字的钱，例如8（寓意发财）或者双数（寓意好事成双）。春节期间，红包里面的钱也被叫做压岁钱（粤语叫扎年钱），通常是指家长派给子女以及长辈发给晚辈的红包，或者已婚已工作人士给予未婚人士（因各地区具体习俗而略有不同），代表给予祝福和好运。
              今天，在红包的传统意义得到保留的基础上，形成了当代人民的新的红包交流方式，就是现在的红包文化。同样地，红包文化因为地区的不同和网络的生活，可以分为三大类别：<b>广东话地区的利是文化</b>，<b>普通话地区的红包文</b>化和<b>网络的虚拟红包文化</b>。
            </div>
            <div class="pic1">
              <img src="../assets/1.jpg">
            </div>
            <div class="para2">
              <h3>广东话地区的利是文化</h3>保留了最多红包的传统习俗，它的演变表现在不断扩大了红包的使用场合。广东话地区包含了广东省大部分地区以及香港、澳门和海外的粤语华人为主的广大群体的区域。从发音而言，广东话的红包这个物体叫红封包或者利是封（利事封），红包这个概念就利是，送红包这个动作叫做派利是。派利是这个动作，同样的是长辈对于晚辈或者已婚对于未婚人士，强调的是“派”这个动作的广泛性，因而广东话地区的利是文化的演变也主要在于它的广泛性更大。当年我妈妈住院的时候，她会给每一个来探病的亲友回礼一个利是，里面大概只有十块钱，却希望去除探病的亲友来医院所沾上的晦气，原因是我妈妈觉得医院是“不干净”的地方，必须得靠能带来好运的利是驱逐晦气。同样地，所有喜庆宴席，无论乔迁之喜、新婚或者寿宴，除了宾客给予利是祝贺，主人家也会给予一个回礼利是；新年的时候，广东人都喜欢家里摆个大花瓶插上漂亮的花迎新春，而春花上也会挂满利是表现吉祥如意。在我老家，有趣的是，村里的老人家都喜欢过年给满村跑的小孩子们每个一个小利是，可能里面就一块钱甚至一毛钱，并且利是封就是一张简单的红色纸折叠而成，就是寓意着吉祥、送福。一直到今天，利是里的金钱数额都不大，因此，广东人也被冠以“抠门”的衔头。但作为广东人，我挺热爱自己的家乡文化，毕竟“红色炸弹”的压力不大，而且也能多次派利是增加亲友感情的交流。
            </div>
            <div class="pic2">

            </div>
            <div class="para3">
              <h3>普通话地区的红包文化</h3>对于传统红包的意义，它的变化其实不大，但是今天却给很多人造成了很大的负担。目前中国大陆除了广东地区以外的地区基本上都处于这种主流普通话地区的红包文化思想里。它的文化意义仍然保留着传统习俗里面的喜庆和吉祥如意，及其作用对象也还是长辈给予晚辈的祝福。最近十来年，红包被看成了红色的票子（中国目前最大面额的红色100元），因此，给予越多，红包越厚，会让人感觉倍有“面子”；而对方也以“会做人”的方式在下一次送红包的场合回礼，如新年互送对方小孩比较大数额的红包.
            </div>
            <div class="pic3">
              <img src="../assets/1.jpg">
            </div>
            <div class="para4">
              <h3>虚拟红包</h3>顾名思义就是网络上的红包。互联网的发展提高了人们的交流频率，而微信以及支付宝的抢红包功能出现也成为了改变了我们送红包的方式：从现实到虚拟。社交软件上的红包功能设定了上限，也可以写上祝福语。由于数额不大，1块钱也能发出来让十个人抢红包，富有娱乐性，从而随时随地发红包已经成为了中国网民的一个娱乐节目，并且祝福语也能称为留言板写上各种语句。虚拟红包的出现，也让现实的送红包增加了途径。一些有事不能参与宴席而又想送上一份祝福的朋友们会选择送上虚拟红包已表示对朋友的诚意。在国际环境中，很多老外理解不了中国的红包文化，不知道社交网站上抢红包的乐趣所在，随着BBC纪录片的推广，相信中国的传统红包文化也会进入外国人的视野，迟早有一天他们也会在网络上和我们一同抢红包。
            </div>
          </div>
        </el-tab-pane>
        <el-tab-pane label="舞狮" name="second">
          <div class="wushi">
            <div class="word" style="text-align: center;">
              <div class="para1">
                <h1>舞狮</h1>是中国优秀的传统民间艺术，每逢佳节或隆重庆典，民间都以狮舞来助兴。
                狮子舞在旧时称"太平乐"；在豫北当地人俗语称：“玩狮”，至今在新乡、焦作、安阳等地一直流传。而到了唐代时更得到广泛的发展。狮艺在当时已成为过年过节、行香走会中的必备节目。至今已有一千五百多年的历史。
                其实它最早是从西域传入的，狮子是文殊菩萨的坐骑，随着佛教传入中国，舞狮子的活动也传入中国。狮子是汉武帝派张骞出使西域后，和孔雀等一同带回的贡品。
              </div>
              <div class="pic1">
                <img src="../assets/1.jpg" style="width: 400px">
              </div>
              <div class="para2">
                在近两千年里不断发展，逐渐成为咱们中国自己的东西，而如今大体可分为南北两大派系。
                <p><b>北狮</b>在长江以北较为流行，狮身披毛呈金黃、橙、红色，看起来像是一只惟妙惟肖的狮子，走的是写实派。它的表演也接近于杂耍，就是踩踩球，跳跳板凳，讲的就是一个热闹。
                  而南狮，也就是广东舞狮，电影《黄飞鸿之三：狮王争霸》的原产地，这是最为常见的舞狮。南狮色彩相较北狮更为艳丽，五颜六色还带有很多装饰物，风格是抽象派，流行于华南地区、南洋及海外。
                  中国舞狮，以“北狮”起源较早。相传北朝魏武帝远征甘肃河西，俘虏胡人十万，魏武帝把他们囚困於边荒三年。一日，魏武帝巡视边区，边将设宴款待，并令胡人献舞娱乐。胡人以木雕兽头，两大五小，披兽衣，集八音乐，武士三十余人，起舞於御前。舞者作欢腾喜悅之状，或作低首相怜，舞技之美妙，令武帝叹为观止。武帝传胡人，询其所舞，胡人答曰：“北魏朝圣，四方匡伏，西凉乐伎，同沾皇恩。”武帝听罢龙心大悅，赐名“北魏瑞狮”，恩准俘虏回国。自此，狮子舞便在北方流传开来，遂有“北狮”之称。
                </p>
              </div>
              <div class="pic2">
                <img src="../assets/1.jpg">
              </div>
              <div class="para3">
                <p>
                  至于舞<b>南狮</b>起源则有数个传说，最普遍的说法认为南狮乃源自广东佛山某地。每年除夕，该地必出现一头怪兽，头大身小，身长十数尺，眼若铜铃，来去如风，不断呼出“年年”之声。乡人故命其名为“年兽”。此年兽每年出现之时，不伤人畜，只到处嚼食田间蔬菜而去。乡民不胜其扰，乃召集村人，议定用竹篾纸料，依其形状，紥成兽头，涂以各色，再以各种布料剪成三角形状，制成兽身，两人持而舞之，再集乡民数十，携带响器，伏於田间桥下，候年兽出现时，群起击动响器，声震田野，果然吓走年兽，不再出现。
                  民间因纸紥兽头能驱走年兽，便每年制作这种兽头，于除夕鼓舞，称为“舞年”，后经乡老们研究认为狮子为兽类中威武瑞祥的动物，便将“舞年”改称为“舞瑞狮”。
                  舞狮中主要表现狮子喜、怒、哀乐、动、静、惊、疑等八种神态，以采青为己任，历尽艰险取得胜利。南狮是集观赏性、艺术性竞技性为一体的具有强烈吉祥、喜庆色彩和气氛渲染能力。
                  随着锣鼓的节奏， 狮子从"沉睡惊醒"、"搔头摆尾"、"仰视低顾"、 "探测方向"，到"出洞"、"见青"、"碎青"、"狂欢"、"翻滚"等，动作千姿百态，栩栩如生。狮子在人们心中很富有人情味，时而威风凛凛，怒视邪恶；时而谦恭有礼，憨厚善良，逗人喜爱。醒狮造型套路很多：起势、常态、奋起、疑进、抓痒、迎宾、施礼、惊跃、审视、酣睡、出洞、发威、过山、上楼台等等，无不神似，一句话，喜则欢而碎步，怒则仪态万千，哀则闭眼稳步，乐则跃而跨步。这也是南狮中重"意"的舞法表现。
                </p>
              </div>
              <div class="pic3">
                <img src="../assets/1.jpg">
              </div>
              <p>
                北狮的舞姿，主要在表演的善良与灵巧，翻滾跳跃，首尾相引合，步法整齐合一，加上充京钹、京锣、京鼓等音乐节拍，按乐声起舞，引者舞持球翻腾滚鹤，表現武士雄姿。持球者引狮起舞，而舞狮头者除跟随持球武士各种动作而配合演出各种舞姿外，还必须给舞狮尾者以充份默契，而舞狮尾者亦必须留意狮头动向，头则尾亦动，头定则尾亦定，跳跃翻滚，紧密跟随，使能头尾舞姿调协，融成一体，方上称舞技。
              </p>
              <p>
                南狮是富有南方风格的一种狮形，它额高而窄，眼大而能转动，口阔带笔，背宽、鼻塌、面颊饱满，牙齿能隐能露。分文狮、武狮和少狮三大类。文狮以刘备、关公作脸谱，武狮以张飞作脸谱，文狮表现温驯而和善，狮表现勇猛而刚烈；少狮即幼狮，憨态可爱，一般跟随文、舞狮同场表演。南狮造型极度夸张浪漫，威武雄壮，美丽活泼，形神兼备。
              </p>
            </div>

          </div>
        </el-tab-pane>
        <el-tab-pane label="贴春联" name="third">
          <div class="chunlian">
            <div class="title"><h2>春联，起源于桃符（周代悬挂在大门两旁的长方形桃木板）。</h2></div>
            <div class="pic1">
              <img src="../assets/1.jpg">
            </div>

            <h3>据《后汉书·礼仪志》所载，桃符长六寸，宽三寸，桃木板
              上书降鬼大神“神荼”、“郁垒”的名字。“正月一日，造桃符
              着户，名仙木，百鬼所畏。”所以，清代《燕京时岁记》上
              记载：“春联者，即桃符也。”五代十国时，宫廷里，有人在
              桃符上题写联语。《宋史·蜀世家》说：后蜀主孟昶令学士
              辛寅逊题桃木板，“以其非工，自命笔题云：‘新年纳余庆，
              嘉节号长春’，这便是中国的第一副春联。不过宋代不同史料
              对此说法不一，也有说是辛寅逊或孟昶的儿子孟喆所撰。
            </h3>
            <h3>直到宋代，春联仍称“桃符”。王安石的诗中就有“千门万户曈曈日，
              总把新桃换旧符”之句。宋代，桃符由桃木板改为纸张，叫“春
              贴纸”和“春联”。这一习俗起于宋代，在明代开始盛行，到了
              清代，春联的思想性和艺术性都有了很大的提高。现在贴春联
              已成风俗，红色的对联贴在大门上，房子顿时生辉。正如诗云
              ：“喜气临门红色妍，家家户户贴春联；旧年辞别迎新岁，时
              序车轮总向前。”</h3>
          </div>
        </el-tab-pane>
        <el-tab-pane label="拜年" name="fourth">
          <div id="bainian">
            <div class="video-content">
              <player-video :src="src"></player-video>
            </div>
            <div class="intro">

              <h1>春节拜年的由来</h1>
              <p>
                大年初一，人人都早早起来，打扮得整整齐齐，出门走亲访友，相互拜年，恭祝来年大吉大利。
                关于拜年习俗的由来，传说远古时代有一种怪兽，头顶长独角，口似血盆，人们叫它做“年”。
                每逢腊月三十晚上,它便窜出山林，掠食噬人。人们只好备些肉食放在门外，然后把大门关上,
                躲在家里，直到初一早晨,“年”饱餐后扬长而去，人们才开门相见，作揖道喜，互相祝贺。
              </p>

              <h2>拜年习俗</h2>
              <p>
                拜年是中国民间的传统习俗，是人们辞旧迎新、相互表达美好祝愿的一种方式。

                古时“拜年”一词原有的含义是为长者拜贺新年，包括向长者叩头施礼、祝贺新年如意、
                问候生活安好等内容。遇有同辈亲友，也要施礼道贺。 拜年一般从家里开始。
                初一早晨，晚辈起床后，要先向长辈拜年，祝福长辈健康长寿，万事如意。
                长辈受拜以后，要将事先准备好的“压岁钱”分给晚辈。在给家中长辈拜完年以后，
                人们外出相遇时也要笑容满面地恭贺新年，互道“恭喜发财”、“四季如意”、
                “新年快乐”等吉祥的话语，左右邻居或亲朋好友亦相互登门拜年或相邀饮酒娱乐。

                宋人孟元老在《东京梦华录》卷六中描写北宋汴京时云：“十月一日年节，
                开封府放关扑三日，士庶自早相互庆贺。”明中叶陆容在《菽园杂记》卷五中说“京师元旦日，
                上自朝官，下至庶人，往来交错道路者连日，谓之‘拜年’。然士庶人各拜其亲友多出实心。
                朝官往来，则多泛爱不专……”。清人顾铁卿在《清嘉录》中描写，“男女以次拜家长毕，
                主者率卑幼，出谒邻族戚友，或止遣子弟代贺，谓之‘拜年’。至有终岁不不相接者，此时亦互相往拜于门……。”

                在古代，上层士大夫有用名帖互相投贺的习俗。宋人周辉在《清波杂志》中说：“宋元佑年间，
                新年贺节，往往使用佣仆持名刺代往”。当时士大夫交游广，若四处登门拜年，既耗费时间，
                也耗费精力，因此有些关系不大密切的朋友就不亲自前往，而是派仆人拿一种用梅花笺纸裁成的二寸宽、
                三寸长，上面写有受贺人姓名、住址和恭贺话语的卡片前往代为拜年。明代人们以投谒代替拜年。
                明朝杰出画家、诗人文征明在《贺年》诗中描述：“不求见面惟通谒，名纸朝来满蔽庐；
                我亦随人投数纸，世憎嫌简不嫌虚”。这里所言的“名刺”和“名谒"即是现今贺年卡的起源。
                贺年卡用于联络感情和互致问候，既方便又实用，乃至今日仍盛行不衰。

                大约从清朝时候起，拜年又添“团拜”的形式，清人艺兰主在《侧帽余谭》中说：
                “京师于岁首，例行团拜，以联年谊，以敦乡情”，“每岁由值年书红订客，饮食宴会，作竟日欢”。
              </p>
            </div>
          </div>
        </el-tab-pane>
      </el-tabs>
    </div>
  </div>
</template>

<script>
import VideoPlayer from "@/components/VideoPlayer";
export default {
  data() {
    return {
      src:require( "../assets/test.mp4"),
      activeName: 'first',
    }
  },
  methods: {
    handleClick(tab, event) {
      console.log(tab, event, this.activeName)
    }
  }
}
</script>

<style scoped>


::v-deep .el-tab-pane{
  color: crimson;
}

::v-deep .el-tabs__item.is-active {
  color: crimson;
}

::v-deep .el-tabs__item {
  font-size: 20px !important;
}

::v-deep .el-tabs__active-bar {
  background-color: crimson;
}

.title_wrd{
  color: crimson;
}

.root{
  font-family: 新宋体;
}

</style>
